START_GREETING_MESSAGE : str = ("👋 Привет, {first_name}! " + \
                                "Это бот компании АвтоНаходка.\n\n"
                                "🚗 Мы помогаем приобрести новые и поддержанные автомобили из Китая, \
                                    Кореи и Японии, сэкономить до 2 000 000 ₽ и получить их за 15-45 дней!\n\n" + \
                                "Далее расскажем, почему авто из Азии в лучшем состоянии, \
                                    а их покупка - выгодна и безопасна.\n\n"
                                "⚠️ Чтобы получить максимальную пользу от бота, \
                                    выбирайте подходящие варианты ответов, нажимая на соответствующие кнопки.\n\n" + \
                                "Важно❗\n" + \
                                "Выбор можно сделать только один раз.\
                                    Пожалуйста выбирайте внимательно, так как после нажатия кнопки \
                                    изменить его не получится.\n\n" + 
                                "❌ Обратите внимание: здесь не ведутся диалоги. \
                                    Чтобы определить, как мы можем помочь и к какому \
                                    специалисту вас направить, ответьте на вопросы бота.\n\n" + \
                                "Жмите на кнопку ниже 👇")
REQUEST_MESSAGE : str = ("Сейчас наша компания ощущает огромный спрос на автомобили.\n\n" + \
                         "✅ Готовы к покупке в течение 30 дней? Направим вас сразу\
                            к эксперту по импорту, чтобы ускорить процесс.\n\n" + \
                         "👀 Ещё присматриваетесь? Мы подготовим предложение в \
                            течение 2-3 дней, чтобы вы могли всё обдумать.\n\n" + \
                         "❗️Пожалуйста, выбирайте внимательно. Это поможет снизить нагрузку, направить\
                            запрос в нужный отдел и обеспечить вам быстрый расчёт и лучшее обслуживание.\n\n" + \
                         "🗨️ Вы готовы к покупке или присматриваетесь?\n\n" + \
                         "Жмите на кнопку ниже 👇")
QA_MESSAGE : str = ("Отлично!\n\n" + \
                    "Выберите вопрос, который интересует и Илья отправит вам персональный ответ.\n\n" + \
                    "1️⃣ Какие гарантии предоставляете?\n" + \
                    "2️⃣ Как я могу быть уверен, что меня не обманут?\n" + \
                    "3️⃣ Какие есть риски при покупке автомобиля из-за рубежа?\n" + \
                    "4️⃣ Из чего складывается стоимость из из Кореи, Китая и Японии?\n" + \
                    "5️⃣ Кто осматриваем автомобили, если вы находитесь в России?\n" + \
                    "6️⃣ Страхуется ли автомобиль во время доставки?\n\n" + \
                    "Нажмите на цифру 👇")
AVAILABLE_MESSAGE : str = ("Наш Telegram-канал с автомобилями, уже \
                                проверенными и готовыми к покупке!\n\n" + \
                           "❗️Все авто в наличии, доставка в РФ - до 30 дней.\n"+\
                           "🔥 Экономьте до 2 000 000 ₽ от рыночной стоимости!\n\n" + \
                           "Ссылка на канал:\n" + \
                           "👉 https://linktoyourchanel\n\n" + \
                           "Что вас ждёт:\n" +\
                           "▪️ Новые авто из Китая по ценам производителя\n" + \
                           "▪️ Поддержанные авто из Китая и Кореи с полным осмотром\n\n" + \
                           "За их состояние и точность описания мы отвечаем лично!\n\n" + \
                           "Подписывайтесь, чтобы первыми видеть лучшие предложения!\n\n" + \
                           '👉 Нажмите на кнопку "Авто в наличии"')