START_GREETING_MESSAGE : str = ("👋 Привет, {first_name}!\n"
                                "Добро пожаловать в бот компании АвтоНаходка.\n\n"
                                "🚗 Мы помогаем приобрести новые и поддержанные автомобили из Китая, Кореи и Японии, \
                                экономя до 2 000 000 ₽ и доставляя их за 15-45 дней!\n\n"
                                "Давайте расскажем, почему авто из Азии — это:\n"
                                "▪️ лучшее состояние\n"
                                "▪️ выгодная цена\n"
                                "▪️ безопасная покупка.\n\n"
                                "⚠️ Чтобы получить максимальную пользу от бота, выбирайте варианты ответов, нажимая на кнопки ниже.\n\n"
                                "Важно❗\n"
                                "Выбор можно сделать только один раз. Пожалуйста, будьте внимательны — изменить решение после нажатия кнопки нельзя.\n\n"
                                "❌ Обратите внимание: бот не поддерживает диалоги. Чтобы мы быстрее определили, чем вам помочь, \
                                ответьте на вопросы бота. Это направит вас к нужному специалисту.\n\n"
                                "👇 Жмите на кнопку ниже, чтобы начать!")
                                
REQUEST_MESSAGE : str = ("🔥 Сейчас огромный спрос на автомобили!\n\n"
                         "✅ Готовы к покупке в течение 30 дней?\n"
                         "Мы направим вас сразу к эксперту по импорту, чтобы ускорить процесс.\n\n"
                         "👀 Присматриваетесь? Мы подготовим предложение за 2-3 дня, чтобы вы могли всё обдумать.\n\n"
                         "❗️ Пожалуйста, выбирайте внимательно. Это поможет нам быстрее обработать ваш запрос и обеспечить лучший сервис.\n\n"
                         "🗨️ Вы готовы к покупке или пока рассматриваете варианты?\n\n"
                         "👇 Нажмите на кнопку ниже.")
                         
QA_MESSAGE : str = ("✨ Отлично!\n\n"
                    "Выберите интересующий вопрос, и Илья отправит персональный ответ:\n\n"
                    "1️⃣ Какие гарантии предоставляете?\n"
                    "2️⃣ Как я могу быть уверен, что меня не обманут?\n"
                    "3️⃣ Какие риски при покупке авто из-за рубежа?\n"
                    "4️⃣ Из чего складывается стоимость авто из Китая, Кореи, Японии?\n"
                    "5️⃣ Кто осматривает авто, если вы в России?\n"
                    "6️⃣ Страхуется ли авто при доставке?\n\n"
                    "👇 Нажмите на цифру.")

CHANNEL_LINK = "https://t.me/nihaoavto"           

AVAILABLE_MESSAGE : str = ("🌟 Наш Telegram-канал с авто в наличии! Все машины проверены и готовы к покупке.\n\n"
                           "❗️Срок доставки в РФ — до 30 дней.\n"
                           "🔥 Экономия до 2 000 000 ₽ от рыночной стоимости!\n\n"
                           f"👉 Ссылка на канал:\n{CHANNEL_LINK}\n\n"
                           "Что вас ждёт:\n"
                           "▪️ Новые авто из Китая по ценам производителя.\n"
                           "▪️ Поддержанные авто из Китая и Кореи с полным осмотром.\n\n"
                           "📋 Мы отвечаем за состояние автомобилей и точность описаний!\n\n"
                           "Подписывайтесь, чтобы первыми видеть лучшие предложения.\n\n"
                           '👉 Нажмите на кнопку "Авто в наличии".')
                           
MENU_RENDER_MESSAGE : str = ("🔍 Что вас интересует?\n\n"
                             "💰 Расчёт стоимости авто:\n"
                             "Получите стоимость авто с доставкой и таможней под ключ. Отлично подходит для тех, кто готов к покупке.\n\n"
                             "📝 Подбор авто по параметрам:\n"
                             "Мы подготовим подборку авто, идеально подходящих под ваши запросы.\n\n"
                             "🚗 Авто в наличии:\n"
                             "Проверенные авто с доставкой в РФ до 30 дней.\n\n"
                             "👇 Выберите подходящий пункт.")
